# Note: in our original (Theano) model, we used tanh instead of RELU and
#       also we didn't have normalization layers at the output of each
#       convolutional layer...


name: "CiresanN3"

#input: "data"
#input_dim: 10
#input_dim: 1
#input_dim: 28
#input_dim: 28

layers {
  type: MEMORY_DATA
  name: "data"
  top: "data"
  top: "label"
  memory_data_param {
    batch_size:  10
    channels:    1
    height:      28
    width:       28
  }
}

layers {
  name: "scale"
  type: POWER
  bottom: "data"
  top: "scale"
  power_param {
    scale: 0.0125
  }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "scale"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 200
    pad: 0
    kernel_size: 5     
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 350
    pad: 0
    kernel_size: 4
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 2
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "sigmoid1"
  type: SIGMOID
  bottom: "ip1"
  top: "ip2"
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
#  include: { phase: TEST }
}

layers {
  type: SIGMOID_CROSS_ENTROPY_LOSS
  name: "loss"
  top: "loss"
  bottom: "ip1"
  bottom: "label"
  #loss_weight: 1
}


layers {
  type: SIGMOID
  name: "prob"
  top: "prob"
  bottom: "ip1"
}
