#  train_epoch: 400  lr = 0.01   momentum: 0.0 gamma: 0.9 stepsize: 200
#  
#


name: "Softmax"

#input: "data"
#input_dim: 64
#input_dim: 1
#input_dim: 28
#input_dim: 28

layers {
  type: MEMORY_DATA
  name: "data"
  top: "data"
  top: "label"  
  memory_data_param {
    batch_size:  64
    channels:    1
    height:      28
    width:       28
  }
}


layers {
  name: "scale"
  type: POWER
  bottom: "data"
  top: "scale"
  power_param {
    scale: 0.0125
  }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "scale"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 5
    pad: 0
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"      
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 10
    pad: 0
    kernel_size: 5     
    stride: 1
    weight_filler {
      type: "xavier"      
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 20
    pad: 0
    kernel_size: 4
    stride: 1
    weight_filler {
      type: "xavier"      
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 1
  convolution_param {
    num_output: 2
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "ip2"
  type: RELU
  bottom: "conv4"
  top: "ip2"
}

layers {
  type: SOFTMAX
  name: "prob"
  top: "prob"
  bottom: "ip2"
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  exclude: { phase: TEST }
}
layers {
  type: SOFTMAX_LOSS
  name: "loss"
  top: "loss"
  bottom: "ip2"
  bottom: "label"
  #loss_weight: 1
  exclude: { phase: TEST }
}
